In [3]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_theme()

In [5]:
# Read in CSV files
brands = pd.read_csv('Datasets/brands.csv')
categories = pd.read_csv('Datasets/categories.csv')
customers = pd.read_csv('Datasets/customers.csv')
order_items = pd.read_csv('Datasets/order_items.csv')
orders = pd.read_csv('Datasets/orders.csv')
products = pd.read_csv('Datasets/products.csv')
staffs = pd.read_csv('Datasets/staffs.csv')
stocks = pd.read_csv('Datasets/stocks.csv')
stores = pd.read_csv('Datasets/stores.csv')

In [6]:
# Create database connection
connection = sqlite3.connect('bike_store.db')

In [7]:
# Insert data into database
brands.to_sql('brands', connection, if_exists='replace', index=False)
categories.to_sql('categories', connection, if_exists='replace', index=False)
customers.to_sql('customers', connection, if_exists='replace', index=False)
order_items.to_sql('order_items', connection, if_exists='replace', index=False)
orders.to_sql('orders', connection, if_exists='replace', index=False)
products.to_sql('products', connection, if_exists='replace', index=False)
staffs.to_sql('staffs', connection, if_exists='replace', index=False)
stocks.to_sql('stocks', connection, if_exists='replace', index=False)
stores.to_sql('stores', connection, if_exists='replace', index=False)

3

SELECT & FROM

We want to get all the categories of bikes

In [10]:
# Run SQL query and load results into a DataFrame
query = """
SELECT 
    category_name 
FROM 
    categories;
"""

# Another weay of doing the same thing
# query = """
# SELECT 
#     * 
# FROM 
#     categories;
# """

df = pd.read_sql_query(query, connection)
df

         category_name
0    Children Bicycles
1     Comfort Bicycles
2    Cruisers Bicycles
3  Cyclocross Bicycles
4       Electric Bikes
5       Mountain Bikes
6           Road Bikes

ORDER BY, DISTINCT, LIMIT

ORDER BY allows us to order the output of the query by 1 or more columns.

In [12]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
ORDER BY
    first_name;
"""

df = pd.read_sql_query(query, connection)
df

     first_name  last_name
0         Aaron      Knapp
1         Abbey       Pugh
2          Abby     Gamble
3         Abram   Copeland
4          Adam  Henderson
...         ...        ...
1440       Zona    Cameron
1441       Zora       Ford
1442    Zoraida     Patton
1443     Zulema   Browning
1444     Zulema    Clemons

[1445 rows x 2 columns]

In [18]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
ORDER BY
    first_name, last_name DESC;
"""

df = pd.read_sql_query(query, connection)
df

     first_name last_name
0         Aaron     Knapp
1         Abbey      Pugh
2          Abby    Gamble
3         Abram  Copeland
4          Adam  Thornton
...         ...       ...
1440       Zona   Cameron
1441       Zora      Ford
1442    Zoraida    Patton
1443     Zulema   Clemons
1444     Zulema  Browning

[1445 rows x 2 columns]

In [19]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
ORDER BY
    first_name, last_name DESC
LIMIT 5;
"""

df = pd.read_sql_query(query, connection)
df

  first_name last_name
0      Aaron     Knapp
1      Abbey      Pugh
2       Abby    Gamble
3      Abram  Copeland
4       Adam  Thornton

In [20]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
WHERE first_name = "Zulema" 
AND last_name = "Clemons"
OR last_name = "Pugh"
ORDER BY
    first_name, last_name DESC;
"""

df = pd.read_sql_query(query, connection)
df

  first_name last_name
0      Abbey      Pugh
1       Ross      Pugh
2     Zulema   Clemons

In [21]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
WHERE first_name = "Zulema" 
AND (last_name = "Clemons"
OR last_name = "Pugh")
ORDER BY
    first_name, last_name DESC;
"""

df = pd.read_sql_query(query, connection)
df

  first_name last_name
0     Zulema   Clemons

In [25]:
query = """
SELECT 
    first_name,
    last_name
FROM 
    customers
WHERE first_name = "Zulema" 
OR last_name = "Pugh"
AND last_name = "Browning"
ORDER BY
    first_name, last_name DESC;
"""

df = pd.read_sql_query(query, connection)
df

  first_name last_name
0     Zulema   Clemons
1     Zulema  Browning

In [29]:
query = """
SELECT 
    *
FROM 
    customers
WHERE
    state NOT IN ('CA', 'NY')
AND city IN ("Houston")
AND phone IS NOT NULL
LIMIT 5;
"""

df = pd.read_sql_query(query, connection)
df

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,43,Mozelle,Carter,(281) 489-9656,mozelle.carter@aol.com,895 Chestnut Ave.,Houston,TX,77016
1,56,Lolita,Mosley,(281) 363-3309,lolita.mosley@hotmail.com,376 S. High Ridge St.,Houston,TX,77016
2,135,Dorthey,Jackson,(281) 926-8010,dorthey.jackson@msn.com,9768 Brookside St.,Houston,TX,77016
3,203,Minerva,Decker,(281) 271-6390,minerva.decker@yahoo.com,794 Greenrose Street,Houston,TX,77016
4,360,Van,Peters,(281) 658-7772,van.peters@yahoo.com,45 Fifth Dr.,Houston,TX,77016

In [33]:
query = """
SELECT *
from Products
WHERE product_name LIKE "T%"
LIMIT 5;
"""

df = pd.read_sql_query(query, connection)
df

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,Trek 820 - 2016,9,6,2016,379.99
1,4,Trek Fuel EX 8 29 - 2016,9,6,2016,2899.99
2,7,Trek Slash 8 27.5 - 2016,9,6,2016,3999.99
3,8,Trek Remedy 29 Carbon Frameset - 2016,9,6,2016,1799.99
4,9,Trek Conduit+ - 2016,9,5,2016,2999.99

In [42]:
query = """
SELECT COUNT(order_id) AS Total_orders , SUM(quantity) AS Total_quantity , SUM(list_price) AS Total_sales , MIN(discount) AS Max_Discount ,
AVG(list_price * (1 -discount)) AS Actual_average_selling_price
FROM order_items;
"""

df = pd.read_sql_query(query,connection)
df

,Total_orders,Total_quantity,Total_sales,Max_Discount,Actual_average_selling_price
0,4722,7078,5.726407e+06,0.05,1086.009722

In [46]:
query = """
SELECT product_id , SUM(quantity * list_price*(1-discount)) AS Total_sales
FROM order_items
GROUP BY product_id
HAVING Total_sales > 5000
ORDER BY Total_sales DESC;
"""

df = pd.read_sql_query(query,connection)
df

     product_id  Total_sales
0             7  555558.6111
1             9  389248.7025
2             4  368472.7294
3            11  226765.5510
4            56  211584.6153
..          ...          ...
175         135    5219.9652
176          88    5198.1264
177         161    5127.3000
178          89    5113.2565
179         306    5039.9440

[180 rows x 2 columns]